# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git-compatible distributed version control system
brew "jj"
# Convert JPG images to ASCII
brew "jp2a"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Utility to extend trackpad functionality
cask "middleclick"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
vscode "anysphere.cpptools"
vscode "anysphere.cursorpyright"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "ziglang.vscode-zig"
